burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_rcu.h
/*!
    \file    gd32m53x_rcu.c
    \brief   RCU driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x

*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_RCU_H
#define GD32M53X_RCU_H

#include "gd32m53x.h"

/* RCU definitions */
#define RCU                             RCU_BASE                              /*!< RCU base address */

/* registers definitions */
#define RCU_CTL                         REG32(RCU + 0x00000000U)              /*!< control register */
#define RCU_CFG0                        REG32(RCU + 0x00000004U)              /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x00000008U)              /*!< clock interrupt register */
#define RCU_APB2RST                     REG32(RCU + 0x0000000CU)              /*!< APB2 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x00000010U)              /*!< APB1 reset register */
#define RCU_AHBEN                       REG32(RCU + 0x00000014U)              /*!< AHB1 enable register */
#define RCU_APB2EN                      REG32(RCU + 0x00000018U)              /*!< APB2 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x0000001CU)              /*!< APB1 enable register */
#define RCU_RSTSCK                      REG32(RCU + 0x00000024U)              /*!< reset source / clock register */
#define RCU_AHBRST                      REG32(RCU + 0x00000028U)              /*!< AHB reset register */
#define RCU_CFG1                        REG32(RCU + 0x0000002CU)              /*!< clock configuration register 1 */
#define RCU_CFG2                        REG32(RCU + 0x00000030U)              /*!< clock configuration register 2 */

/* bits definitions */
/* RCU_CTL */
#define RCU_CTL_IRC32MEN                BIT(0)                                /*!< internal high speed oscillator enable */
#define RCU_CTL_IRC32MSTB               BIT(1)                                /*!< IRC32M high speed internal oscillator stabilization flag */
#define RCU_CTL_IRC32MADJ               BITS(3,7)                             /*!< internal 32M RC oscillator clock trim adjust value */
#define RCU_CTL_IRC32MCALIB             BITS(8,15)                            /*!< internal 32M RC oscillator calibration value */
#define RCU_CTL_HXTALEN                 BIT(16)                               /*!< external high speed oscillator enable */
#define RCU_CTL_HXTARST                 BIT(17)                               /*!< External high speed oscillator ready reset */
#define RCU_CTL_HXTALSTB                BIT(18)                               /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALBPS                BIT(19)                               /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_CKMEN                   BIT(20)                               /*!< HXTAL clock monitor enable */
#define RCU_CTL_PLLMEN                  BIT(21)                               /*!< PLL clock monitor enable */
#define RCU_CTL_HXTALSCAL               BIT(22)                               /*!< HXTAL frequency scale select */
#define RCU_CTL_PLLEN                   BIT(24)                               /*!< PLL enable */
#define RCU_CTL_PLLSTB                  BIT(25)                               /*!< PLL clock stabilization flag */

/* RCU_CFG0 */
#define RCU_CFG0_SCS                    BITS(0,1)                             /*!< system clock switch */
#define RCU_CFG0_SCSS                   BITS(2,3)                             /*!< system clock switch status */
#define RCU_CFG0_AHBPSC                 BITS(4,7)                             /*!< AHB prescaler selection */
#define RCU_CFG0_APB1PSC                BITS(8,10)                            /*!< APB1 prescaler selection */
#define RCU_CFG0_APB2PSC                BITS(11,13)                           /*!< APB2 prescaler selection */
#define RCU_CFG0_PLLSEL                 BIT(16)                               /*!< PLL clock source selection */
#define RCU_CFG0_PLLMF                  BITS(17,23)                           /*!< PLL clock multiplication factor */
#define RCU_CFG0_CKOUTSEL               BITS(24,26)                           /*!< CKOUT clock source selection */
#define RCU_CFG0_CKOUTDIV               BITS(28,30)                           /*!< CK_OUT divider which the CK_OUT frequency can be reduced */
#define RCU_CFG0_PLLDV                  BIT(31)                               /*!< CK_PLL divide by 1 or 8 for CK_OUT */

/* RCU_INT */
#define RCU_INT_IRC32KSTBIF             BIT(0)                                /*!< IRC32K stabilization interrupt flag */
#define RCU_INT_IRC32MSTBIF             BIT(2)                                /*!< IRC32M stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF              BIT(3)                                /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_PLLSTBIF                BIT(4)                                /*!< PLL stabilization interrupt flag */
#define RCU_INT_PLLMIF                  BIT(6)                                /*!< PLL clock monitor interrupt flag */
#define RCU_INT_CKMIF                   BIT(7)                                /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_IRC32KSTBIE             BIT(8)                                /*!< IRC32K stabilization interrupt enable */
#define RCU_INT_IRC32MSTBIE             BIT(10)                               /*!< IRC32M stabilization interrupt enable */
#define RCU_INT_HXTALSTBIE              BIT(11)                               /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_PLLSTBIE                BIT(12)                               /*!< PLL stabilization interrupt enable */
#define RCU_INT_PLLMIE                  BIT(14)                               /*!< PLL clock monitor interrupt enable */
#define RCU_INT_IRC32KSTBIC             BIT(16)                               /*!< IRC32K stabilization interrupt clear */
#define RCU_INT_IRC32MSTBIC             BIT(18)                               /*!< IRC32M stabilization interrupt clear */
#define RCU_INT_HXTALSTBIC              BIT(19)                               /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_PLLSTBIC                BIT(20)                               /*!< PLL stabilization interrupt clear */
#define RCU_INT_PLLMIC                  BIT(22)                               /*!< PLL clock monitor interrupt clear */
#define RCU_INT_CKMIC                   BIT(23)                               /*!< HXTAL clock stuck interrupt clear */

/* RCU_APB2RST */
#define RCU_APB2RST_CFGRST              BIT(0)                                /*!< system configuration reset */
#define RCU_APB2RST_CMPRST              BIT(1)                                /*!< comparator reset */
#define RCU_APB2RST_ADC0RST             BIT(8)                                /*!< ADC0 reset */
#define RCU_APB2RST_ADC2RST             BIT(9)                                /*!< ADC2 reset */
#define RCU_APB2RST_TIMER0RST           BIT(11)                               /*!< TIMER0 reset */
#define RCU_APB2RST_SPIRST              BIT(12)                               /*!< SPI reset */
#define RCU_APB2RST_TIMER7RST           BIT(13)                               /*!< TIMER7 reset */
#define RCU_APB2RST_TIMER1RST           BIT(16)                               /*!< TIMER1 reset */
#define RCU_APB2RST_TIMER2RST           BIT(17)                               /*!< TIMER2 reset */
#define RCU_APB2RST_GPTIMER0RST         BIT(21)                               /*!< GPTIMER0 reset */
#define RCU_APB2RST_GPTIMER1RST         BIT(22)                               /*!< GPTIMER1 reset */
#define RCU_APB2RST_CANRST              BIT(30)                               /*!< CAN reset */

/* RCU_APB1RST */
#define RCU_APB1RST_CPTIMER0RST         BIT(0)                                /*!< CPTIMER0 reset */
#define RCU_APB1RST_CPTIMER1RST         BIT(1)                                /*!< CPTIMER1 reset */
#define RCU_APB1RST_CPTIMERWRST         BIT(4)                                /*!< CPTIMERW reset */
#define RCU_APB1RST_WWDGTRST            BIT(12)                               /*!< WWDGT reset */
#define RCU_APB1RST_UART0RST            BIT(16)                               /*!< UART0 reset */
#define RCU_APB1RST_UART1RST            BIT(17)                               /*!< UART1 reset */
#define RCU_APB1RST_UART2RST            BIT(18)                               /*!< UART2 reset */
#define RCU_APB1RST_UART3RST            BIT(19)                               /*!< UART3 reset */
#define RCU_APB1RST_I2CRST              BIT(21)                               /*!< I2C reset */
#define RCU_APB1RST_CFMURST             BIT(24)                               /*!< CFMU reset */
#define RCU_APB1RST_PMURST              BIT(28)                               /*!< PMU reset */
#define RCU_APB1RST_DACRST              BIT(29)                               /*!< DAC reset */

