burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_rcu.h
/* RCU_AHBEN */
#define RCU_AHBEN_DMA0EN                BIT(0)                                /*!< DMA0 clock enable */
#define RCU_AHBEN_DMA1EN                BIT(1)                                /*!< DMA1 clock enable */
#define RCU_AHBEN_SRAMSPEN              BIT(2)                                /*!< SRAM clock enable when sleep mode */
#define RCU_AHBEN_DMAMUXEN              BIT(3)                                /*!< DMAMUX clock enable */
#define RCU_AHBEN_CRCEN                 BIT(6)                                /*!< CRC clock enable */
#define RCU_AHBEN_PAEN                  BIT(16)                               /*!< GPIOA clock enable */
#define RCU_AHBEN_PBEN                  BIT(17)                               /*!< GPIOB clock enable */
#define RCU_AHBEN_PCEN                  BIT(18)                               /*!< GPIOC clock enable */
#define RCU_AHBEN_PDEN                  BIT(19)                               /*!< GPIOD clock enable */
#define RCU_AHBEN_PEEN                  BIT(20)                               /*!< GPIOE clock enable */
#define RCU_AHBEN_PFEN                  BIT(21)                               /*!< GPIOF clock enable */
#define RCU_AHBEN_PGEN                  BIT(22)                               /*!< GPIOG clock enable */
#define RCU_AHBEN_PNEN                  BIT(23)                               /*!< GPION clock enable */
#define RCU_AHBEN_POCEN                 BIT(26)                               /*!< POC clock enable */
#define RCU_AHBEN_GTOCEN                BIT(27)                               /*!< GTOC clock enable */
#define RCU_AHBEN_SVPWMEN               BIT(28)                               /*!< SVPWM clock enable */
#define RCU_AHBEN_TMUEN                 BIT(29)                               /*!< TMU clock enable */

/* RCU_APB2EN */
#define RCU_APB2EN_CFGEN                BIT(0)                                /*!< System configuration clock enable */
#define RCU_APB2EN_CMPEN                BIT(1)                                /*!< Comparator clock enable */
#define RCU_APB2EN_ADC0EN               BIT(8)                                /*!< ADC0 clock enable */
#define RCU_APB2EN_ADC2EN               BIT(9)                                /*!< ADC2 clock enable */
#define RCU_APB2EN_TIMER0EN             BIT(11)                               /*!< TIMER0 clock enable */
#define RCU_APB2EN_SPIEN                BIT(12)                               /*!< SPI clock enable */
#define RCU_APB2EN_TIMER7EN             BIT(13)                               /*!< TIMER7 clock enable */
#define RCU_APB2EN_TIMER1EN             BIT(16)                               /*!< TIMER1 clock enable */
#define RCU_APB2EN_TIMER2EN             BIT(17)                               /*!< TIMER2 clock enable */
#define RCU_APB2EN_GPTIMER0EN           BIT(21)                               /*!< GPTIMER0 clock enable */
#define RCU_APB2EN_GPTIMER1EN           BIT(22)                               /*!< GPTIMER1 clock enable */
#define RCU_APB2EN_EVICEN               BIT(24)                               /*!< EVIC clock enable */
#define RCU_APB2EN_CANEN                BIT(30)                               /*!< CAN clock enable */

/* RCU_APB1EN */
#define RCU_APB1EN_CPTIMER0EN           BIT(0)                                /*!< CPTIMER0 clock enable */
#define RCU_APB1EN_CPTIMER1EN           BIT(1)                                /*!< CPTIMER1 clock enable */
#define RCU_APB1EN_CPTIMERWEN           BIT(4)                                /*!< CPTIMERW clock enable */
#define RCU_APB1EN_WWDGTEN              BIT(12)                               /*!< WWDGT clock enable */
#define RCU_APB1EN_UART0EN              BIT(16)                               /*!< UART0 clock enable */
#define RCU_APB1EN_UART1EN              BIT(17)                               /*!< UART1 clock enable */
#define RCU_APB1EN_UART2EN              BIT(18)                               /*!< UART2 clock enable */
#define RCU_APB1EN_UART3EN              BIT(19)                               /*!< UART3 clock enable */
#define RCU_APB1EN_I2CEN                BIT(21)                               /*!< I2C clock enable */
#define RCU_APB1EN_CFMUEN               BIT(24)                               /*!< CFMU clock enable */
#define RCU_APB1EN_PMUEN                BIT(28)                               /*!< PMU clock enable */
#define RCU_APB1EN_DACEN                BIT(29)                               /*!< DAC clock enable */

/* RCU_RSTSCK */
#define RCU_RSTSCK_IRC32KEN             BIT(0)                                /*!< IRC32K enable */
#define RCU_RSTSCK_IRC32KSTB            BIT(1)                                /*!< IRC32K stabilization flag */
#define RCU_RSTSCK_LOCKUPRSTEN          BIT(10)                               /*!< CPU lock-up reset enable */
#define RCU_RSTSCK_LOHRSTEN             BIT(13)                               /*!< lost of HXTAL reset enable */
#define RCU_RSTSCK_LOPRSTEN             BIT(14)                               /*!< lost of PLL reset enable */
#define RCU_RSTSCK_LVD0RSTF             BIT(16)                               /*!< low voltage 0 detect error reset flag */
#define RCU_RSTSCK_LOCKUPRSTF           BIT(18)                               /*!< CPU lock-up error reset flag */
#define RCU_RSTSCK_LVD1RSTF             BIT(19)                               /*!< low voltage 1 detect error reset flag */
#define RCU_RSTSCK_LVD2RSTF             BIT(20)                               /*!< low voltage 2 detect error reset flag */
#define RCU_RSTSCK_LOHRSTF              BIT(21)                               /*!< lost of HXTAL error reset flag */
#define RCU_RSTSCK_LOPRSTF              BIT(22)                               /*!< lost of PLL error reset flag */
#define RCU_RSTSCK_V11RSTF              BIT(23)                               /*!< 1.1V domain power reset flag */
#define RCU_RSTSCK_RSTFC                BIT(24)                               /*!< reset flag clear */
#define RCU_RSTSCK_OBLRSTF              BIT(25)                               /*!< option byte loader reset flag */
#define RCU_RSTSCK_EPRSTF               BIT(26)                               /*!< external pin reset flag */
#define RCU_RSTSCK_PORRSTF              BIT(27)                               /*!< power reset flag */
#define RCU_RSTSCK_SWRSTF               BIT(28)                               /*!< software reset flag */
#define RCU_RSTSCK_FWDGTRSTF            BIT(29)                               /*!< free watchdog timer reset flag */
#define RCU_RSTSCK_WWDGTRSTF            BIT(30)                               /*!< window watchdog timer reset flag */
#define RCU_RSTSCK_LPRSTF               BIT(31)                               /*!< low-power reset flag */

