burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_rcu.h
/* RCU_AHBRST */
#define RCU_AHBRST_DMA0RST              BIT(0)                                /*!< DMA0 reset */
#define RCU_AHBRST_DMA1RST              BIT(1)                                /*!< DMA1 reset */
#define RCU_AHBRST_DMAMUXRST            BIT(3)                                /*!< DMAMUX reset */
#define RCU_AHBRST_CRCRST               BIT(6)                                /*!< CRC reset */
#define RCU_AHBRST_PARST                BIT(16)                               /*!< GPIO port A reset */
#define RCU_AHBRST_PBRST                BIT(17)                               /*!< GPIO port B reset */
#define RCU_AHBRST_PCRST                BIT(18)                               /*!< GPIO port C reset */
#define RCU_AHBRST_PDRST                BIT(19)                               /*!< GPIO port D reset */
#define RCU_AHBRST_PERST                BIT(20)                               /*!< GPIO port E reset */
#define RCU_AHBRST_PFRST                BIT(21)                               /*!< GPIO port F reset */
#define RCU_AHBRST_PGRST                BIT(22)                               /*!< GPIO port G reset */
#define RCU_AHBRST_PNRST                BIT(23)                               /*!< GPIO port N reset */
#define RCU_AHBRST_POCRST               BIT(26)                               /*!< POC reset */
#define RCU_AHBRST_GTOCRST              BIT(27)                               /*!< GTOC reset */
#define RCU_AHBRST_SVPWMRST             BIT(28)                               /*!< SVPWMRST reset */
#define RCU_AHBRST_TMURST               BIT(29)                               /*!< TMU reset */

/* RCU_CFG1 */
#define RCU_CFG1_PREDV                  BITS(0,2)                             /*!< CK_HXTAL divider previous PLL */

/* RCU_CFG2 */
#define RCU_CFG2_I2CSEL                 BITS(8,9)                             /*!< IIC clock source selection */
#define RCU_CFG2_ADCSEL                 BITS(25,26)                           /*!< ADC clock source selection */
#define RCU_CFG2_ADCPSC                 BITS(27,31)                           /*!< ADC prescaler selection */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)                 (REG32(RCU + ((uint32_t)(periph) >> 6)))
#define RCU_BIT_POS(val)                    ((uint32_t)(val) & 0x0000001FU)

/* register offset */
/* peripherals enable */
#define AHBEN_REG_OFFSET                ((uint32_t)0x00000014U)              /*!< AHB enable register offset */
#define APB1EN_REG_OFFSET               ((uint32_t)0x0000001CU)              /*!< APB1 enable register offset */
#define APB2EN_REG_OFFSET               ((uint32_t)0x00000018U)              /*!< APB2 enable register offset */

/* peripherals reset */
#define AHBRST_REG_OFFSET               ((uint32_t)0x00000028U)              /*!< AHB reset register offset */
#define APB1RST_REG_OFFSET              ((uint32_t)0x00000010U)              /*!< APB1 reset register offset */
#define APB2RST_REG_OFFSET              ((uint32_t)0x0000000CU)              /*!< APB2 reset register offset */
#define RSTSCK_REG_OFFSET               ((uint32_t)0x00000024U)              /*!< reset source/clock register offset */

/* clock control */
#define CTL_REG_OFFSET                  ((uint32_t)0x00000000U)              /*!< control register offset */
/* clock stabilization and stuck interrupt */
#define INT_REG_OFFSET                  ((uint32_t)0x00000008U)              /*!< clock interrupt register offset */

/* configuration register */
#define CFG1_REG_OFFSET                 ((uint32_t)0x0000002CU)              /*!< clock configuration register 1 offset */
#define CFG2_REG_OFFSET                 ((uint32_t)0x00000030U)              /*!< clock configuration register 2 offset */

/* peripheral clock enable */
typedef enum {
    /* AHB peripherals */
    RCU_DMA0          = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 0U),                /*!< DMA0 clock */
    RCU_DMA1          = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 1U),                /*!< DMA1 clock */
    RCU_DMAMUX        = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 3U),                /*!< DMAMUX clock */
    RCU_CRC           = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 6U),                /*!< CRC clock */
    RCU_GPIOA         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 16U),               /*!< GPIOA clock */
    RCU_GPIOB         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 17U),               /*!< GPIOB clock */
    RCU_GPIOC         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 18U),               /*!< GPIOC clock */
    RCU_GPIOD         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 19U),               /*!< GPIOD clock */
    RCU_GPIOE         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 20U),               /*!< GPIOE clock */
    RCU_GPIOF         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 21U),               /*!< GPIOF clock */
    RCU_GPIOG         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 22U),               /*!< GPIOG clock */
    RCU_GPION         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 23U),               /*!< GPION clock */
    RCU_POC           = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 26U),               /*!< POC clock */
    RCU_GTOC          = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 27U),               /*!< GTOC clock */
    RCU_SVPWM         = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 28U),               /*!< SVPWM clock */
    RCU_TMU           = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 29U),               /*!< TMU clock */
    /* APB2 peripherals */
    RCU_SYSCFG        = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 0U),               /*!< SYSCFG clock */
    RCU_CMP           = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 1U),               /*!< CMP clock */
    RCU_ADC0          = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 8U),               /*!< ADC0 clock */
    RCU_ADC2          = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 9U),               /*!< ADC2 clock */
    RCU_TIMER0        = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 11U),              /*!< TIMER0 clock */
    RCU_SPI           = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 12U),              /*!< SPI clock */
    RCU_TIMER7        = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 13U),              /*!< TIMER7 clock */
    RCU_TIMER1        = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 16U),              /*!< TIMER1 clock */
    RCU_TIMER2        = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 17U),              /*!< TIMER2 clock */
    RCU_GPTIMER0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 21U),              /*!< GPTIMER0 clock */
    RCU_GPTIMER1      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 22U),              /*!< GPTIMER1 clock */
    RCU_EVIC          = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 24U),              /*!< EVIC clock*/
    RCU_CAN           = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 30U),              /*!< CAN clock */
    /* APB1 peripherals */
    RCU_CPTIMER0      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 0U),               /*!< CPTIMER0 clock */
    RCU_CPTIMER1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 1U),               /*!< CPTIMER1 clock */
    RCU_CPTIMERW      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 4U),               /*!< CPTIMERW clock */
    RCU_WWDGT         = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 12U),              /*!< WWDGT clock */
    RCU_UART0         = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 16U),              /*!< UART0 clock */
    RCU_UART1         = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 17U),              /*!< UART1 clock */
    RCU_UART2         = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 18U),              /*!< UART2 clock */
    RCU_UART3         = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 19U),              /*!< UART3 clock */
    RCU_I2C           = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 21U),              /*!< I2C clock */
    RCU_CFMU          = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 24U),              /*!< CFMU clock */
    RCU_PMU           = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 28U),              /*!< PMU clock */
    RCU_DAC           = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 29U),              /*!< DAC clock */
} rcu_periph_enum;

