burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_rcu.h
/* peripherals reset */
typedef enum {
    /* AHB peripherals */
    RCU_DMA0RST       = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 0U),                /*!< DMA0 clock reset */
    RCU_DMA1RST       = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 1U),                /*!< DMA1 clock reset */
    RCU_DMAMUXRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 3U),                /*!< DMAMUX clock reset */
    RCU_CRCRST        = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 6U),                /*!< CRC clock reset */
    RCU_GPIOARST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 16U),               /*!< GPIOA clock reset */
    RCU_GPIOBRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 17U),               /*!< GPIOB clock reset */
    RCU_GPIOCRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 18U),               /*!< GPIOC clock reset */
    RCU_GPIODRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 19U),               /*!< GPIOD clock reset */
    RCU_GPIOERST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 20U),               /*!< GPIOE clock reset */
    RCU_GPIOFRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 21U),               /*!< GPIOF clock reset */
    RCU_GPIOGRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 22U),               /*!< GPIOG clock reset */
    RCU_GPIONRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 23U),               /*!< GPION clock reset */
    RCU_POCRST        = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 26U),               /*!< POC clock reset */
    RCU_GTOCRST       = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 27U),               /*!< GTOC clock reset */
    RCU_SVPWMRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 28U),               /*!< SVPWM clock reset */
    RCU_TMURST        = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 29U),               /*!< TMU clock reset */
    /* APB2 peripherals */
    RCU_SYSCFGRST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 0U),               /*!< system configuration reset */
    RCU_CMPRST        = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 1U),               /*!< Comparator reset */
    RCU_ADC0RST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 8U),               /*!< ADC0 clock reset */
    RCU_ADC2RST       = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 9U),               /*!< ADC2 clock reset */
    RCU_TIMER0RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 11U),              /*!< TIMER0 clock reset */
    RCU_SPIRST        = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 12U),              /*!< SPI clock reset */
    RCU_TIMER7RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 13U),              /*!< TIMER7 clock reset */
    RCU_TIMER1RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 16U),              /*!< TIMER1 clock reset */
    RCU_TIMER2RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 17U),              /*!< TIMER2 clock reset */
    RCU_GPTIMER0RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 21U),              /*!< GPTIMER0 clock reset */
    RCU_GPTIMER1RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 22U),              /*!< GPTIMER1 clock reset */
    RCU_CANRST        = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 30U),              /*!< CAN clock reset */
    /* APB1 peripherals */
    RCU_CPTIMER0RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 0U),               /*!< CPTIMER0 clock reset */
    RCU_CPTIMER1RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 1U),               /*!< CPTIMER1 clock reset */
    RCU_CPTIMERWRST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 4U),               /*!< CPTIMERW clock reset */
    RCU_WWDGTRST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 12U),              /*!< WWDGT clock reset */
    RCU_UART0RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 16U),              /*!< UART0 clock reset */
    RCU_UART1RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 17U),              /*!< UART1 clock reset */
    RCU_UART2RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 18U),              /*!< UART2 clock reset */
    RCU_UART3RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 19U),              /*!< UART3 clock reset */
    RCU_I2CRST        = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 21U),              /*!< I2C clock reset */
    RCU_CFMURST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 24U),              /*!< CFMU clock reset */
    RCU_PMURST        = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 28U),              /*!< PMU clock reset */
    RCU_DACRST        = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 29U),              /*!< DAC clock reset */
} rcu_periph_reset_enum;

/* peripheral clock enable when sleep mode*/
typedef enum {
    /* AHB peripherals */
    RCU_SRAM_SLP           = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 2U),            /*!< SRAM clock */
    RCU_FMC_SLP            = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 4U),            /*!< FMC clock */
} rcu_periph_sleep_enum;

/* clock stabilization and peripheral reset flags */
typedef enum {
    /* clock stabilization flags */
    RCU_FLAG_IRC32MSTB         = RCU_REGIDX_BIT(CTL_REG_OFFSET, 1U),         /*!< IRC32M stabilization flag */
    RCU_FLAG_HXTALSTB          = RCU_REGIDX_BIT(CTL_REG_OFFSET, 18U),        /*!< HXTAL stabilization flag */
    RCU_FLAG_PLLSTB            = RCU_REGIDX_BIT(CTL_REG_OFFSET, 25U),        /*!< PLL stabilization flag */
    /* reset source flags */
    RCU_FLAG_IRC32KSTB         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 1U),      /*!< IRC32K stabilization flag */
    RCU_FLAG_LVD0RST           = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 16U),     /*!< low voltage0 detect error reset flag */
    RCU_FLAG_LOCKUPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 18U),     /*!< CPU LOCK UP error reset flag */
    RCU_FLAG_LVD1RST           = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 19U),     /*!< low voltage1 detect error reset flag */
    RCU_FLAG_LVD2RST           = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 20U),     /*!< low voltage2 detect error reset flag */
    RCU_FLAG_LOHRST            = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 21U),     /*!< lost of HXTAL error reset flag */
    RCU_FLAG_LOPRST            = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 22U),     /*!< lost of PLL error reset flag */
    RCU_FLAG_V11RST            = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 23U),     /*!< 1.1V domain Power reset flag */
    RCU_FLAG_RSTFC             = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 24U),     /*!< reset flag clear */
    RCU_FLAG_OBLRST            = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 25U),     /*!< option byte loader reset flag */
    RCU_FLAG_EPRST             = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 26U),     /*!< external PIN reset flag */
    RCU_FLAG_PORRST            = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 27U),     /*!< power reset flag */
    RCU_FLAG_SWRST             = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 28U),     /*!< software reset flag */
    RCU_FLAG_FWDGTRST          = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 29U),     /*!< FWDGT reset flag */
    RCU_FLAG_WWDGTRST          = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 30U),     /*!< WWDGT reset flag */
    RCU_FLAG_LPRST             = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 31U),     /*!< low-power reset flag */
} rcu_flag_enum;

/* clock stabilization and ckm interrupt flags */
typedef enum {
    RCU_INT_FLAG_IRC32KSTB     = RCU_REGIDX_BIT(INT_REG_OFFSET, 0U),         /*!< IRC32K stabilization interrupt flag */
    RCU_INT_FLAG_IRC32MSTB     = RCU_REGIDX_BIT(INT_REG_OFFSET, 2U),         /*!< IRC32M stabilization interrupt flag */
    RCU_INT_FLAG_HXTALSTB      = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),         /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_PLLSTB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 4U),         /*!< PLL stabilization interrupt flag */
    RCU_INT_FLAG_PLLM          = RCU_REGIDX_BIT(INT_REG_OFFSET, 6U),         /*!< PLL clock monitor interrupt flag */
    RCU_INT_FLAG_CKM           = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),         /*!< HXTAL clock stuck interrupt flag */
} rcu_int_flag_enum;

