burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_rcu.h
/* PLL clock multiplication factor */
#define CFG0_PLLMF(regval)              (BITS(17,23) & ((uint32_t)(regval) << 17))
#define RCU_PLL_MUL4                    CFG0_PLLMF(7)                        /*!< PLL clock source multiply by 4 */
#define RCU_PLL_MUL4POINT5              CFG0_PLLMF(8)                        /*!< PLL clock source multiply by 4.5 */
#define RCU_PLL_MUL5                    CFG0_PLLMF(9)                        /*!< PLL clock source multiply by 5 */
#define RCU_PLL_MUL5POINT5              CFG0_PLLMF(10)                       /*!< PLL clock source multiply by 5.5 */
#define RCU_PLL_MUL6                    CFG0_PLLMF(11)                       /*!< PLL clock source multiply by 6 */
#define RCU_PLL_MUL6POINT5              CFG0_PLLMF(12)                       /*!< PLL clock source multiply by 6.5 */
#define RCU_PLL_MUL7                    CFG0_PLLMF(13)                       /*!< PLL clock source multiply by 7 */
#define RCU_PLL_MUL7POINT5              CFG0_PLLMF(14)                       /*!< PLL clock source multiply by 7.5 */
#define RCU_PLL_MUL8                    CFG0_PLLMF(15)                       /*!< PLL clock source multiply by 8 */
#define RCU_PLL_MUL8POINT5              CFG0_PLLMF(16)                       /*!< PLL clock source multiply by 8.5 */
#define RCU_PLL_MUL9                    CFG0_PLLMF(17)                       /*!< PLL clock source multiply by 9 */
#define RCU_PLL_MUL9POINT5              CFG0_PLLMF(18)                       /*!< PLL clock source multiply by 9.5 */
#define RCU_PLL_MUL10                   CFG0_PLLMF(19)                       /*!< PLL clock source multiply by 10 */
#define RCU_PLL_MUL10POINT5             CFG0_PLLMF(20)                       /*!< PLL clock source multiply by 10.5 */
#define RCU_PLL_MUL11                   CFG0_PLLMF(21)                       /*!< PLL clock source multiply by 11 */
#define RCU_PLL_MUL11POINT5             CFG0_PLLMF(22)                       /*!< PLL clock source multiply by 11.5 */
#define RCU_PLL_MUL12                   CFG0_PLLMF(23)                       /*!< PLL clock source multiply by 12 */
#define RCU_PLL_MUL12POINT5             CFG0_PLLMF(24)                       /*!< PLL clock source multiply by 12.5 */
#define RCU_PLL_MUL13                   CFG0_PLLMF(25)                       /*!< PLL clock source multiply by 13 */
#define RCU_PLL_MUL13POINT5             CFG0_PLLMF(26)                       /*!< PLL clock source multiply by 13.5 */
#define RCU_PLL_MUL14                   CFG0_PLLMF(27)                       /*!< PLL clock source multiply by 14 */
#define RCU_PLL_MUL14POINT5             CFG0_PLLMF(28)                       /*!< PLL clock source multiply by 14.5 */
#define RCU_PLL_MUL15                   CFG0_PLLMF(29)                       /*!< PLL clock source multiply by 15 */
#define RCU_PLL_MUL15POINT5             CFG0_PLLMF(30)                       /*!< PLL clock source multiply by 15.5 */
#define RCU_PLL_MUL16                   CFG0_PLLMF(31)                       /*!< PLL clock source multiply by 16 */
#define RCU_PLL_MUL16POINT5             CFG0_PLLMF(32)                       /*!< PLL clock source multiply by 16.5 */
#define RCU_PLL_MUL17                   CFG0_PLLMF(33)                       /*!< PLL clock source multiply by 17 */
#define RCU_PLL_MUL17POINT5             CFG0_PLLMF(34)                       /*!< PLL clock source multiply by 17.5 */
#define RCU_PLL_MUL18                   CFG0_PLLMF(35)                       /*!< PLL clock source multiply by 18 */
#define RCU_PLL_MUL18POINT5             CFG0_PLLMF(36)                       /*!< PLL clock source multiply by 18.5 */
#define RCU_PLL_MUL19                   CFG0_PLLMF(37)                       /*!< PLL clock source multiply by 19 */
#define RCU_PLL_MUL19POINT5             CFG0_PLLMF(38)                       /*!< PLL clock source multiply by 19.5 */
#define RCU_PLL_MUL20                   CFG0_PLLMF(39)                       /*!< PLL clock source multiply by 20 */
#define RCU_PLL_MUL20POINT5             CFG0_PLLMF(40)                       /*!< PLL clock source multiply by 20.5 */
#define RCU_PLL_MUL21                   CFG0_PLLMF(41)                       /*!< PLL clock source multiply by 21 */
#define RCU_PLL_MUL21POINT5             CFG0_PLLMF(42)                       /*!< PLL clock source multiply by 21.5 */
#define RCU_PLL_MUL22                   CFG0_PLLMF(43)                       /*!< PLL clock source multiply by 22 */
#define RCU_PLL_MUL22POINT5             CFG0_PLLMF(44)                       /*!< PLL clock source multiply by 22.5 */
#define RCU_PLL_MUL23                   CFG0_PLLMF(45)                       /*!< PLL clock source multiply by 23 */
#define RCU_PLL_MUL23POINT5             CFG0_PLLMF(46)                       /*!< PLL clock source multiply by 23.5 */
#define RCU_PLL_MUL24                   CFG0_PLLMF(47)                       /*!< PLL clock source multiply by 24 */
#define RCU_PLL_MUL24POINT5             CFG0_PLLMF(48)                       /*!< PLL clock source multiply by 24.5 */
#define RCU_PLL_MUL25                   CFG0_PLLMF(49)                       /*!< PLL clock source multiply by 25 */
#define RCU_PLL_MUL25POINT5             CFG0_PLLMF(50)                       /*!< PLL clock source multiply by 25.5 */
#define RCU_PLL_MUL26                   CFG0_PLLMF(51)                       /*!< PLL clock source multiply by 26 */
#define RCU_PLL_MUL26POINT5             CFG0_PLLMF(52)                       /*!< PLL clock source multiply by 26.5 */
#define RCU_PLL_MUL27                   CFG0_PLLMF(53)                       /*!< PLL clock source multiply by 27 */
#define RCU_PLL_MUL27POINT5             CFG0_PLLMF(54)                       /*!< PLL clock source multiply by 27.5 */
#define RCU_PLL_MUL28                   CFG0_PLLMF(55)                       /*!< PLL clock source multiply by 28 */
#define RCU_PLL_MUL28POINT5             CFG0_PLLMF(56)                       /*!< PLL clock source multiply by 28.5 */
#define RCU_PLL_MUL29                   CFG0_PLLMF(57)                       /*!< PLL clock source multiply by 29 */
#define RCU_PLL_MUL29POINT5             CFG0_PLLMF(58)                       /*!< PLL clock source multiply by 29.5 */
#define RCU_PLL_MUL30                   CFG0_PLLMF(59)                       /*!< PLL clock source multiply by 30 */
#define RCU_PLL_MUL30POINT5             CFG0_PLLMF(60)                       /*!< PLL clock source multiply by 30.5 */
#define RCU_PLL_MUL31                   CFG0_PLLMF(61)                       /*!< PLL clock source multiply by 31 */
#define RCU_PLL_MUL31POINT5             CFG0_PLLMF(62)                       /*!< PLL clock source multiply by 31.5 */
#define RCU_PLL_MUL32                   CFG0_PLLMF(63)                       /*!< PLL clock source multiply by 32 */
#define RCU_PLL_MUL32POINT5             CFG0_PLLMF(64)                       /*!< PLL clock source multiply by 32.5 */
#define RCU_PLL_MUL33                   CFG0_PLLMF(65)                       /*!< PLL clock source multiply by 33 */
#define RCU_PLL_MUL33POINT5             CFG0_PLLMF(66)                       /*!< PLL clock source multiply by 33.5 */
#define RCU_PLL_MUL34                   CFG0_PLLMF(67)                       /*!< PLL clock source multiply by 34 */
#define RCU_PLL_MUL34POINT5             CFG0_PLLMF(68)                       /*!< PLL clock source multiply by 34.5 */
#define RCU_PLL_MUL35                   CFG0_PLLMF(69)                       /*!< PLL clock source multiply by 35 */
#define RCU_PLL_MUL35POINT5             CFG0_PLLMF(70)                       /*!< PLL clock source multiply by 35.5 */
#define RCU_PLL_MUL36                   CFG0_PLLMF(71)                       /*!< PLL clock source multiply by 36 */
#define RCU_PLL_MUL36POINT5             CFG0_PLLMF(72)                       /*!< PLL clock source multiply by 36.5 */
#define RCU_PLL_MUL37                   CFG0_PLLMF(73)                       /*!< PLL clock source multiply by 37 */
#define RCU_PLL_MUL37POINT5             CFG0_PLLMF(74)                       /*!< PLL clock source multiply by 37.5 */
#define RCU_PLL_MUL38                   CFG0_PLLMF(75)                       /*!< PLL clock source multiply by 38 */
#define RCU_PLL_MUL38POINT5             CFG0_PLLMF(76)                       /*!< PLL clock source multiply by 38.5 */
#define RCU_PLL_MUL39                   CFG0_PLLMF(77)                       /*!< PLL clock source multiply by 39 */
#define RCU_PLL_MUL39POINT5             CFG0_PLLMF(78)                       /*!< PLL clock source multiply by 39.5 */
#define RCU_PLL_MUL40                   CFG0_PLLMF(79)                       /*!< PLL clock source multiply by 40 */
#define RCU_PLL_MUL40POINT5             CFG0_PLLMF(80)                       /*!< PLL clock source multiply by 40.5 */
#define RCU_PLL_MUL41                   CFG0_PLLMF(81)                       /*!< PLL clock source multiply by 41 */
#define RCU_PLL_MUL41POINT5             CFG0_PLLMF(82)                       /*!< PLL clock source multiply by 41.5 */
#define RCU_PLL_MUL42                   CFG0_PLLMF(83)                       /*!< PLL clock source multiply by 42 */
#define RCU_PLL_MUL42POINT5             CFG0_PLLMF(84)                       /*!< PLL clock source multiply by 42.5 */
#define RCU_PLL_MUL43                   CFG0_PLLMF(85)                       /*!< PLL clock source multiply by 43 */
#define RCU_PLL_MUL43POINT5             CFG0_PLLMF(86)                       /*!< PLL clock source multiply by 43.5 */
#define RCU_PLL_MUL44                   CFG0_PLLMF(87)                       /*!< PLL clock source multiply by 44 */
#define RCU_PLL_MUL44POINT5             CFG0_PLLMF(88)                       /*!< PLL clock source multiply by 44.5 */
#define RCU_PLL_MUL45                   CFG0_PLLMF(89)                       /*!< PLL clock source multiply by 45 */
#define RCU_PLL_MUL45POINT5             CFG0_PLLMF(90)                       /*!< PLL clock source multiply by 45.5 */
#define RCU_PLL_MUL46                   CFG0_PLLMF(91)                       /*!< PLL clock source multiply by 46 */
#define RCU_PLL_MUL46POINT5             CFG0_PLLMF(92)                       /*!< PLL clock source multiply by 46.5 */
#define RCU_PLL_MUL47                   CFG0_PLLMF(93)                       /*!< PLL clock source multiply by 47 */
#define RCU_PLL_MUL47POINT5             CFG0_PLLMF(94)                       /*!< PLL clock source multiply by 47.5 */
#define RCU_PLL_MUL48                   CFG0_PLLMF(95)                       /*!< PLL clock source multiply by 48 */
#define RCU_PLL_MUL48POINT5             CFG0_PLLMF(96)                       /*!< PLL clock source multiply by 48.5 */
#define RCU_PLL_MUL49                   CFG0_PLLMF(97)                       /*!< PLL clock source multiply by 49 */
#define RCU_PLL_MUL49POINT5             CFG0_PLLMF(98)                       /*!< PLL clock source multiply by 49.5 */
#define RCU_PLL_MUL50                   CFG0_PLLMF(99)                       /*!< PLL clock source multiply by 50 */
#define RCU_PLL_MUL50POINT5             CFG0_PLLMF(100)                      /*!< PLL clock source multiply by 50.5 */
#define RCU_PLL_MUL51                   CFG0_PLLMF(101)                      /*!< PLL clock source multiply by 51 */
#define RCU_PLL_MUL51POINT5             CFG0_PLLMF(102)                      /*!< PLL clock source multiply by 51.5 */
#define RCU_PLL_MUL52                   CFG0_PLLMF(103)                      /*!< PLL clock source multiply by 52 */
#define RCU_PLL_MUL52POINT5             CFG0_PLLMF(104)                      /*!< PLL clock source multiply by 52.5 */
#define RCU_PLL_MUL53                   CFG0_PLLMF(105)                      /*!< PLL clock source multiply by 53 */
#define RCU_PLL_MUL53POINT5             CFG0_PLLMF(106)                      /*!< PLL clock source multiply by 53.5 */
#define RCU_PLL_MUL54                   CFG0_PLLMF(107)                      /*!< PLL clock source multiply by 54 */
#define RCU_PLL_MUL54POINT5             CFG0_PLLMF(108)                      /*!< PLL clock source multiply by 54.5 */
#define RCU_PLL_MUL55                   CFG0_PLLMF(109)                      /*!< PLL clock source multiply by 55 */
#define RCU_PLL_MUL55POINT5             CFG0_PLLMF(110)                      /*!< PLL clock source multiply by 55.5 */
#define RCU_PLL_MUL56                   CFG0_PLLMF(111)                      /*!< PLL clock source multiply by 56 */
#define RCU_PLL_MUL56POINT5             CFG0_PLLMF(112)                      /*!< PLL clock source multiply by 56.5 */
#define RCU_PLL_MUL57                   CFG0_PLLMF(113)                      /*!< PLL clock source multiply by 57 */
#define RCU_PLL_MUL57POINT5             CFG0_PLLMF(114)                      /*!< PLL clock source multiply by 57.5 */
#define RCU_PLL_MUL58                   CFG0_PLLMF(115)                      /*!< PLL clock source multiply by 58 */
#define RCU_PLL_MUL58POINT5             CFG0_PLLMF(116)                      /*!< PLL clock source multiply by 58.5 */
#define RCU_PLL_MUL59                   CFG0_PLLMF(117)                      /*!< PLL clock source multiply by 59 */
#define RCU_PLL_MUL59POINT5             CFG0_PLLMF(118)                      /*!< PLL clock source multiply by 59.5 */
#define RCU_PLL_MUL60                   CFG0_PLLMF(119)                      /*!< PLL clock source multiply by 60 */
#define RCU_PLL_MUL60POINT5             CFG0_PLLMF(120)                      /*!< PLL clock source multiply by 60.5 */
#define RCU_PLL_MUL61                   CFG0_PLLMF(121)                      /*!< PLL clock source multiply by 61 */
#define RCU_PLL_MUL61POINT5             CFG0_PLLMF(122)                      /*!< PLL clock source multiply by 61.5 */
#define RCU_PLL_MUL62                   CFG0_PLLMF(123)                      /*!< PLL clock source multiply by 62 */
#define RCU_PLL_MUL62POINT5             CFG0_PLLMF(124)                      /*!< PLL clock source multiply by 62.5 */
#define RCU_PLL_MUL63                   CFG0_PLLMF(125)                      /*!< PLL clock source multiply by 63 */
#define RCU_PLL_MUL63POINT5             CFG0_PLLMF(126)                      /*!< PLL clock source multiply by 63.5 */
#define RCU_PLL_MUL64                   CFG0_PLLMF(127)                      /*!< PLL clock source multiply by 64 */

/* CKOUT Clock source selection */
#define CFG0_CKOUTSEL(regval)           (BITS(24,26) & ((uint32_t)(regval) << 24))
#define RCU_CKOUTSRC_NONE               CFG0_CKOUTSEL(0)                     /*!< no clock is selected */
#define RCU_CKOUTSRC_IRC32K             CFG0_CKOUTSEL(2)                     /*!< IRC32K is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_CKSYS              CFG0_CKOUTSEL(4)                     /*!< system clock is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_IRC32M             CFG0_CKOUTSEL(5)                     /*!< IRC32M is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_HXTAL              CFG0_CKOUTSEL(6)                     /*!< HXTAL is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_CKPLL_DIV1         (RCU_CFG0_PLLDV | CFG0_CKOUTSEL(7))  /*!< CK_PLL is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_CKPLL_DIV8         CFG0_CKOUTSEL(7)                     /*!< CK_PLL/8 is selected as CK_OUT clock source */

/* CK_OUT divider */
#define CFG0_CKOUTDIV(regval)           (BITS(28,30) & ((uint32_t)(regval) << 28))
#define RCU_CKOUT_DIV1                  CFG0_CKOUTDIV(0)                     /*!< CK_OUT is divided by 1 */
#define RCU_CKOUT_DIV2                  CFG0_CKOUTDIV(1)                     /*!< CK_OUT is divided by 2 */
#define RCU_CKOUT_DIV4                  CFG0_CKOUTDIV(2)                     /*!< CK_OUT is divided by 4 */
#define RCU_CKOUT_DIV8                  CFG0_CKOUTDIV(3)                     /*!< CK_OUT is divided by 8 */
#define RCU_CKOUT_DIV16                 CFG0_CKOUTDIV(4)                     /*!< CK_OUT is divided by 16 */
#define RCU_CKOUT_DIV32                 CFG0_CKOUTDIV(5)                     /*!< CK_OUT is divided by 32 */
#define RCU_CKOUT_DIV64                 CFG0_CKOUTDIV(6)                     /*!< CK_OUT is divided by 64 */
#define RCU_CKOUT_DIV128                CFG0_CKOUTDIV(7)                     /*!< CK_OUT is divided by 128 */

/* PREDV0 division factor */
#define CFG1_PREDV(regval)              (BITS(0,2) & ((uint32_t)(regval) << 0))
#define RCU_PREDV_DIV1                  CFG1_PREDV(0)                        /*!< PREDV input clock source not divided */
#define RCU_PREDV_DIV2                  CFG1_PREDV(1)                        /*!< PREDV input clock source divided by 2 */
#define RCU_PREDV_DIV3                  CFG1_PREDV(2)                        /*!< PREDV input clock source divided by 3 */
#define RCU_PREDV_DIV4                  CFG1_PREDV(3)                        /*!< PREDV input clock source divided by 4 */
#define RCU_PREDV_DIV5                  CFG1_PREDV(4)                        /*!< PREDV input clock source divided by 5 */
#define RCU_PREDV_DIV6                  CFG1_PREDV(5)                        /*!< PREDV input clock source divided by 6 */
#define RCU_PREDV_DIV7                  CFG1_PREDV(6)                        /*!< PREDV input clock source divided by 7 */
#define RCU_PREDV_DIV8                  CFG1_PREDV(7)                        /*!< PREDV input clock source divided by 8 */

/* I2C clock source selection */
#define CFG2_I2CSRC(regval)             (BITS(8,9) & ((uint32_t)(regval) << 8))
#define RCU_CKI2CSRC_PCLK1              CFG2_I2CSRC(0)                       /*!< PCLK1 is selected as I2C clock source */
#define RCU_CKI2CSRC_PLL                CFG2_I2CSRC(1)                       /*!< PLL is selected as I2C clock source */
#define RCU_CKI2CSRC_IRC32M             CFG2_I2CSRC(2)                       /*!< IRC32M is selected as I2C clock source */
#define RCU_CKI2CSRC_HXTAL              CFG2_I2CSRC(3)                       /*!< HXTAL is selected as I2C clock source */

/* function declarations */
/* peripherals clock configure functions */
/* deinitialize the RCU */
void rcu_deinit(void);
/* enable the peripherals clock */
void rcu_periph_clock_enable(rcu_periph_enum periph);
/* disable the peripherals clock */
void rcu_periph_clock_disable(rcu_periph_enum periph);
/* reset the peripherals */
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset);
/* disable reset the peripheral */
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset);
/* enable the peripherals clock when in sleep mode */
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph);
/* disable the peripherals clock when in sleep mode */
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph);

/* system and peripherals clock source, system reset configure functions */
/* configure the system clock source */
void rcu_system_clock_source_config(uint32_t ck_sys);
/* get the system clock source */
uint32_t rcu_system_clock_source_get(void);
/* configure the AHB prescaler selection */
void rcu_ahb_clock_config(uint32_t ck_ahb);
/* configure the APB1 prescaler selection */
void rcu_apb1_clock_config(uint32_t ck_apb1);
/* configure the APB2 prescaler selection */
void rcu_apb2_clock_config(uint32_t ck_apb2);
/* configure the CK_OUT clock source and divider */
void rcu_ckout_config(uint32_t ckout_src, uint32_t ckout_div);
/* configure the PLL clock source selection and PLL multiply factor */
void rcu_pll_config(uint32_t pll_src, uint32_t predv_div, uint32_t pll_mul);
/* enable RCU system reset */
void rcu_system_reset_enable(uint32_t reset_source);
/* disable RCU system reset */
void rcu_system_reset_disable(uint32_t reset_source);
/* configure the CK_ADCPRE clock source and division factor */
void rcu_adc_clock_config(uint32_t ck_adc, uint32_t adc_psc);
/* configure the I2C division factor */
void rcu_i2c_clock_source_config(uint32_t ck_i2c);

